## `terraform/main`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.repos: Refreshing state... [id=lambda-sample-ecr]
aws_iam_role.lambda: Refreshing state... [id=lambda-sample-role]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lambda-sample-role-20240916002152564400000001]
data.aws_caller_identity.current: Read complete after 1s [id=761624429622]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::761624429622:role/lambda-sample-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-16T00:21:52Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-sample-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-sample-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "owner"     = "okmtdev"
          - "service"   = "lambda-sample"
          - "terraform" = "true"
        } -> null
      - unique_id             = "AROA3CVC2QQ3FVZMZYPHU" -> null
    }

  # aws_iam_role.lambda-sample-role will be created
  + resource "aws_iam_role" "lambda-sample-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-sample-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "lambda-sample-function"
      + id                             = (known after apply)
      + image_uri                      = "761624429622.dkr.ecr.ap-northeast-1.amazonaws.com/lambda-sample-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "owner"     = "okmtdev"
          + "service"   = "lambda-sample"
          + "terraform" = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + timeouts {
          + create = "15m"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>